Revit 2024 API
AppearanceAssetEditScope Constructor
 Constructs a new instance of an AppearanceAssetEditScope.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public AppearanceAssetEditScope(
	Document document
)
Visual Basic
Public Sub New ( _
	document As Document _
)
Visual C++
public:
AppearanceAssetEditScope(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document for which this EditScope is going to be used.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace